# Используем официальный образ Golang как базовый
FROM golang:1.22.7-alpine

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем go.mod и go.sum из корневой директории проекта
COPY ../../go.mod ../../go.sum ./
RUN go mod download

# Копируем исходный код приложения из корневой директории проекта
COPY ../.. .

# Устанавливаем рабочую директорию для сборки сервера
WORKDIR /app/cmd/auth

# Собираем приложение
RUN go build -o /app/cmd/auth/main .

# Открываем порты
EXPOSE 8080

# Запускаем приложение
CMD ["/app/cmd/auth/main"]